In [1]:
import pandas as pd
import numpy as np

In [19]:
xValues = ['MALE', 'MALE', 'MALE', 'FEMALE', 'MALE', 'FEMALE', 'MALE', 'FEMALE', ""]
yValues = [26, 60, 45, 62, 23, 36, 35, 36, ""]

In [20]:
df = pd.DataFrame({'X': xValues, 'Y': yValues})

In [21]:
df

        X   Y
0    MALE  26
1    MALE  60
2    MALE  45
3  FEMALE  62
4    MALE  23
5  FEMALE  36
6    MALE  35
7  FEMALE  36
8

In [22]:
df_summed = df.groupby("X")["Y"].sum().reset_index()

In [23]:
df_summed

        X    Y
0
1  FEMALE  134
2    MALE  189